[
  {
    "path": "posts/2021-02-18-dataviz-makeover-2/",
    "title": "Dataviz Makeover 2",
    "description": "Understand the public willingness on Covid-19 Vaccination",
    "author": [
      {
        "name": "Li Zhenglong",
        "url": {}
      }
    ],
    "date": "2021-02-18",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nOriginal Data Visualisation\r\n1.0 Critiques and Suggestions1.1 Clarity\r\n1.2 Aesthetic\r\n\r\n2.0 Sketch of Proposed Design\r\n3.0 Data Visualization Step-by-step guide3.1 Data preparation\r\n3.2 Error bar on Dot plot\r\n3.3 Likert Scale\r\n3.4 Dashboard\r\n\r\n4.0 Major observations\r\n\r\nOriginal Data Visualisation\r\n\r\n\r\n\r\n1.0 Critiques and Suggestions\r\n1.1 Clarity\r\nS/N\r\nCritiques\r\nSuggestion\r\nC1\r\nWe can only tell the proportion for the individual country in a stacked bar chart but hard to do a comparison with other countries as there are 5 types of responses. This is especially so when the stacked bar chart is sorted alphabetically and the colours are not aligned. Used of random colours make it harder to see the positive and negative responses\r\nTo use Diverging Stacked Bar Chart with Neutral in middle, displaying half negative and half positive to better compare the negatives and positives percentages. By adding a reference line in the middle can further enhance the comparision. The Red and Blue hue colours to be used appropriately to better represent the negative, positive, and grey for neutral responses. Ensure sortings are allowed by both X & Y Axis for better comparisons in different perspective.\r\nC2\r\nThe title “Which country is more pro-vaccine?” can be confusing as it is not the actual survey question used which can be misinterpreted as the responses to “if they think that country citizens are more pro-vaccine?”Besides, having to know the actual list of questions from the data dictionary, we do not know if the chart is based on just 1 question or a series of questions.\r\nTo allow selection and display of the actual questions to be more explicit\r\nC3\r\nThe visualization is based on survey questions, we cannot visualize the uncertainty as we do not know if the sample size is large enough to represent the population. \r\nTo use Error bar on dot plot and statistical values to depict the survey results. Different confidence interval levels can be selected to help better visualize the uncertainty. Tooltip can help to indicate the actual percentage and sample size.\r\nC4\r\nLegend title as Vac1, we do not know what it actually means.Besides, the categories are not fully labeled, we only know 1 for Strongly agree and 5 for Strongly Disagree but not for 2,3, and 4. Its placement is nearer to Bar chart which can be confusing if it applies to which chart or both.\r\nTo have a meaningful legend title and better labeling of the categories to improve the clarity. Proper placement of legend.\r\n1.2 Aesthetic\r\nS/N\r\nCritiques\r\nSuggestion\r\nA1\r\nInconsistent decimal place for X-Axis % in the 2 charts.\r\nEnsure consistent decimal place in the X-Axis\r\nA2\r\nWrong Spelling for Vaccine as vaccine\r\nEnsure words are spelled correctly\r\nA3\r\nCountry Names start with lower case\r\nConvert to Upper case for first letter or whole word\r\nA4\r\nThe use of random colour for the 5 responses can be less aesthetically pleasing and not colourblind friendly The use of Red colour to indicate neutral can cause an unnecessary distraction to neutral data.\r\nTo use contrasting colour-blind friendly colours appropriately. Red and blue colours for negative and positive responses\r\n2.0 Sketch of Proposed Design\r\n\r\nThe title to state clearly the objective of the Data visualization (e.g “Understand the public willingness on Covid-19 vaccination”). Ability to select the questions allows user to have see each questions and their responses. This is further value add by having the flexibility to select by overall or country, and breakdown by demographic with ad-hoc parameters.\r\nFor the Error bar Dot plot, we can select by the different response types and combination of Confidence intervals. The Chart title will be dynamically change to reflect the selections supplement with tooltip for details.\r\nBoth charts are interactive linked to enable cross highlight such as by country or demographic.\r\nFiltering on the right panel allows narrowing down to country selections and the dynamic demographic categories.\r\n3.0 Data Visualization Step-by-step guide\r\n3.1 Data preparation\r\nS/N\r\nInterface\r\nStep\r\nAction\r\n1\r\nFile Explore\r\nUnzip Data set\r\n• Unzip source dataset covid-19-tracker-master.zip• Navigate to data folder• Unzip all data files• Create archive folder and move all the zipped files to the folder \r\n2\r\nData Source\r\nLoad and union all csv\r\n• Click New Union • Select all countries.csv and drag to the union pop up window \r\n3\r\nData Source\r\nHide unnecessary columns\r\n• Hide all columns except Vac_1,vac2_1, vac2_2, vac2_3, vac2_6, vac3, gender, age, household_size, household_children, employment_status and table name that are required for the makeover\r\n4\r\nNew Sheet\r\nCheck for country with no responses\r\n• Drag Vac_1,vac2_1, vac2_2, vac2_3, vac2_6, vac3 into Columns • Drag Table Name into rows• Sort according to count \r\n5\r\nData Source\r\nRemove csv with from union\r\n• Edit union and remove countries’ csv that do not have any survey responses to reduce the dataset • You will be left with 16 Countries \r\n6\r\nData Source\r\nPivot data to tall dataset\r\n• Select Vac_1, vac2_1, vac2_2, vac2_3, vac2_6 and vac3 and right click Pivot • Right click rename Pivot Field Name as Question and Pivot Field Value as Answer\r\n7\r\nData Source\r\nUppercase Country name\r\n• Right click on Table Name and create a new calculated field Country_Name. Using below formula to remove the extension “.csv” and to change the country name to uppercaseupper(REPLACE([Table Name],“.csv” , \"\"))\r\n8\r\nData Source\r\nRenumber score (Optional)\r\n• Right click on Answer Column and create a new calculated field Score6 - INT(left([Answer],1)) This is optional and can be done to by manual sort the display on the chart\r\n9\r\nData Source\r\nSet alias values\r\n• Create new calculated field Score_N with [Score]• And right click and select Aliases.. and set to the following Alias values \r\n10\r\nData Source\r\nCreate Group\r\n• Right click on age column and Create Group by interval of tenth age• Check the distribution and notice that age 18 & 19 and above 70s have much lower counts• Right click on household_size column and Create Group for  Group Null, “Don’t know” and “Prefer not to say”  Group 8 and 8 or more• Repeat the step for household_children and group null and 0 as 0 \r\n3.2 Error bar on Dot plot\r\nS/N\r\nInterface\r\nStep\r\nAction\r\n11\r\nWorksheet %CI\r\nCreate Parameter\r\n• Right click on the left panel select Create Parameter.. and create the following parameters\r\n12\r\nWorksheet %CI\r\nCreate Calculated Fields\r\n• Under Analysis -> Create calculate fields for the followings\r\nCalculated Field\r\nValue\r\nN_Agree\r\nIF[Score] =4 then 1 else 0 end\r\nN_Disagree\r\nIF[Score] =2 then 1 else 0 end\r\nN_Neutral\r\nIF[Score] =3 then 1 else 0 end\r\nN_Strongly Agree\r\nIF[Score] =5 then 1 else 0 end\r\nN_Strongly Disagree\r\nIF[Score] =1 then 1 else 0 end\r\nNumerator\r\ncase[Select Answer] when 1 then [N_Strongly Disagree] when 2 then [N_Disagree] when 3 then [N_Neutral] when 4 then [N_Agree ] when 5 then [N_Strongly Agree] when 6 then [N_Strongly Disagree]+[N_Disagree] when 7 then [N_Strongly Agree]+[N_Agree ] end\r\nNumber of Records\r\n1\r\nProp\r\nsum([Numerator])/sum([Number of Records])\r\n[zvalue_90]\r\n1.645\r\n[zvalue_95]\r\n1.959964\r\n[zvalue_99]\r\n2.575829\r\nProp_SE\r\nSQRT(([Prop]*(1-[Prop]))/sum([Number of Records]))\r\nProp_Margin of Error 90%\r\n[zvalue_90]*[Prop_SE]\r\nProp_Margin of Error 95%\r\n[zvalue_95]*[Prop_SE]\r\nProp_Margin of Error 99%\r\n[zvalue_99]*[Prop_SE]\r\nlower_90\r\nif[Select CI] IN(1,4,6) THEN [Prop]-[Prop_Margin of Error 90%]END\r\nlower_95\r\nif[Select CI] IN(2,4,5,6) THEN[Prop]-[Prop_Margin of Error 95%]END\r\nlower_99\r\nif[Select CI] IN(3,5,6) THEN[Prop]-[Prop_Margin of Error 99% ]END\r\nupper_90\r\nif[Select CI] IN(1,4,6) THEN [Prop]+[Prop_Margin of Error 90%]END\r\nupper_95\r\nif[Select CI] IN(2,4,5,6) THEN[Prop]+[Prop_Margin of Error 95%]END\r\nupper_99\r\nif[Select CI] IN(3,5,6) THEN[Prop]+[Prop_Margin of Error 99% ]END\r\nCountry\r\ncase[Group by] when “Country” then [Country_Name] else \"\" END\r\nDemographic\r\ncase[Breakdown by] when “Nil” then \"“ when”Gender\" then [gender] when “Age” then [age (group)] when “Household_Size” then [household_size (group)] when “Household_Children” then [household_children (group)] when “Employment_Status” then [employment_status] END\r\nS/N\r\nInterface\r\nStep\r\nAction\r\n13\r\nWorksheet %CI\r\nCreate Chart\r\n• Drag Measure Values to Columns,and Country & Demographic to Rows • Remove other Measure Values except the lower_90/95/99 and upper_90/95/99 Measure values in the below order• Change Mark to Line and drag [Measure Names] to both Path and Color • Click on Color and Edit colors.• Drag Prop to Columns. • Change mark type to Circle. • Select Dual Axis and Synchronise Axis. • Change Title to Percentage• Under Tick Marks, Fixed Tick interval to 0.1• Drag Score_N to Filter and uncheck NA to filter out invalid entry.• Edit chart Title to \r\n14\r\nWorksheet %CI\r\nCreate dynamic Tooltip\r\n• Select All under Marks  • Click Tooltip to edit tooltip format and adjust the text and format as shown\r\nCompleted Error bar on Dotplot \r\n3.3 Likert Scale\r\nS/N\r\nInterface\r\nStep\r\nAction\r\n15\r\nWorksheet Proportion\r\nCreate new worksheet for Likert Scale\r\nCreate new worksheet name Proportion\r\n16\r\nWorksheet Proportion\r\nCreate calculate fields\r\nUnder Analysis -> Create calculate fields for the followings\r\nCalculated Field\r\nValue\r\nTotal Count\r\nTotal(sum([Number of Records]))\r\nCount Negative\r\nIf [Score]<3 then 1 ELSEIF [Score]=3 then 0.5 else 0 end\r\nTotal Count Negative\r\nTotal(sum([Count Negative]))\r\nPercentage\r\nsum([Number of Records])/[Total Count]\r\nGantt Start\r\n-[Total Count Negative]/[Total Count]\r\nGantt Percent\r\nPREVIOUS_VALUE([Gantt Start])+zn(LOOKUP([Percentage],-1))\r\ncolour Agree\r\nIF [Score_N]=4 THEN “Agree” Else \"\"END\r\ncolour Disagree\r\nIF [Score_N]=2 THEN “Disagree” Else \"\" END\r\ncolour Neutral\r\nIF [Score_N]=3 THEN “are Neutral” Else \"\" END\r\ncolour Strongly Agree\r\nIF [Score_N]=5 THEN “Strongly Agree” Else \"\" END\r\ncolour Strongly Disagree\r\nIF [Score_N]=1 THEN “Strongly Disagree” Else \"\" END\r\nS/N\r\nInterface\r\nStep\r\nAction\r\n17\r\nWorksheet Proportion\r\nCreate Likert scale chart\r\n• Drag Gantt Percent and Country to Columns and Rows respectively • Change mark to Gantt Bar • Drag Percentage to Size Mark • Repeat filter step done in earlier segment by dragging Score_N to Filter and uncheck NA to filter out invalid entry. • Drag Score_N to Color  • Rename legend Title as Survey Scale • Change Score_N color as shown below. • Edit Gantt Percent Table calculation for both Gantt Percent and Percentage • Check only for Score_N in “compute using”. • Add reference line to X-Axis  • Format x axis to percentage with 0 decimal place and change Axis Title to “Proportion %” • Drag Percentage to Label and format to percentage with 0 Decimal place as well.• Change tick interval to 0.25\r\nCompleted Likert Scale Chart \r\nS/N\r\nInterface\r\nStep\r\nAction\r\n18\r\nWorksheet Proportion\r\nCreate Dynamic Tooltip\r\n• Drag the colour fields to Tooltip • Edit Tooltip and change colour according to Score_N.• Bold and increase font size accordingly • Drag Demographic into Rows for dynamic parameter switch  • Edit Title as\r\n\r\n3.4 Dashboard\r\nS/N\r\nInterface\r\nStep\r\nAction\r\n19\r\nDashboard\r\nCreate dashboard\r\n•Create new dashboard •Drag Sheet Proportion and Sheet CI % to the canvas •Arrange and align the parameters, filters and legend•Rename the Title of the parameters •Create text as source link •Ensure alignment and readability \r\n20\r\nDashboard\r\nLink filters both charts\r\n•For all filters, apply linkages by select All using Related Data Sources so it can be applied to both charts \r\n21\r\nDashboard\r\nCreate action for highlight interaction\r\n•Select Dashboard -> Action -> add Action -> to create new highlight for highlight interaction between the two charts \r\nFinal Dashboard Link to Dashboard\r\n4.0 Major observations\r\n1) Japanese are the most worried about getting COVID-19 with the highest Agree and Strongly Agree (67%), followed by Spanish and South Korean at 64% and 58% respectively. On other hand, Australians and Netherlanders (Dutch) are the least worried about getting COVID-19 at 36%, and 32% agreeing with the statement.\r\n\r\n2) French shows the highest negative and lowest positive in believing their government will provide them with an effective vaccine. while Danish(Denmark) and British(UK) have the highest trust in their government at 68% and 64% positive (Strongly Agree and Agree). Although Israel has a higher positive than Singapore(61%), it has more uncertainty with a larger 99% Confidence interval from 58% to 69% due to a smaller sample size of 503 responses. Singapore has the least negative(Strongly Disagree and Disagree) proportion at 10%.\r\n\r\nJapan is the 2nd lowest positive(45%) but mainly due to the highest neutrality of 40% proportion to government health authorities providing effective COVID-19 vaccine. 3) Across all countries, Females are generally more worried about getting COVID-19 except for Singapore and Australia where Males are marginally equal or more worried about getting the virus.\r\n\r\n4) On the country level, Japan, Singapore, France, and Spain are the top countries worried about the vaccination side effects.\r\n\r\n5) We can observe that older people are more worried about getting COVID-19. \r\nWhile middle age followed by young adults are more worried about vaccine side effects. Age group 90-99 shows large CI due to lower sample size of 26 responses.\r\n\r\nSimilarly, retirees have the highest positive response when asked to get COVID-19 vaccine questions by this week, year and if they never get it, they will regret it.\r\n\r\nRetirees are also one of the least worried about the potential side effect.\r\n\r\nThis may be due to the elderly which are mainly retirees are more vulnerable and have complications due to existing health conditions compared to the younger generation. (WHO , APR 2020) and thus more keen on getting the vaccine.\r\n6) Smaller Household sizes (1-2) were observed to be more positive in getting vaccine consistency across the getting COVID-19 vaccine questions.\r\n\r\nLink to Dashboard\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-02-18-dataviz-makeover-2/picture/0.png",
    "last_modified": "2021-02-19T23:22:49+08:00",
    "input_file": "dataviz-makeover-2.utf8.md"
  },
  {
    "path": "posts/2021-01-27-dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "DataViz Makeover 1",
    "author": [
      {
        "name": "Li Zhenglong",
        "url": {}
      }
    ],
    "date": "2021-01-27",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nOriginal Data Visualisation\r\n1.0 Critiques and Suggestions1.1 Clarity\r\n1.2 Aesthetic\r\n\r\n2.0 Sketch of Proposed Design\r\n3.0 Data Visualization Step-by-step guide3.1 Data preparation\r\n3.2 Create Arrow Chart\r\n3.3 Create Sparklines\r\n3.4 Combining into Dashboard\r\n\r\n4.0 Major observations\r\n\r\nOriginal Data Visualisation\r\n\r\n\r\n\r\n1.0 Critiques and Suggestions\r\n1.1 Clarity\r\nS/N\r\nCritiques\r\nSuggestions\r\n1\r\nThe summary write-up described the increase in the proportion of labour force using age group of 55 & over and 25 to 54. However, the age group for the graph is using an interval of 5. Thus, making it hard to link the lead in with the graph.\r\nTo use a consistent interval of age groups in both graph and text. The dashboard title will serve as an lead-in to summarize the overview insights of the data visualisation.\r\n2\r\nThe title “Resident labour force by age - Per Cent” did not effectively communicate clearly if the measure used is by percentage proportion breakdown, participation rate, or difference in percentage change over the years.\r\nTo reflect the measuring unit LFPR and the comparison between 2009 and 2019. Chart title need to explicitly state the measure and breakdown. “Percentage change in LFPR by Age Group” The comparison period “2009 versus 2019” may be redundant as will be mentioned in the dashboard title.\r\n3\r\nThe line chart does not have an explicit Y-axis scale. Without the Y-axis, the figures cannot be ascertained and the measure is not clear.The X-axis can also be clearer with Age group label.\r\nAdd explicit Y-axis scale and label and X-Axis label in chart title for better clarity.\r\n4\r\nHaving only a snapshot comparing 2009 and 2019 can be misleading. We do not know if the changes are consistent between 2009 to 2019.\r\nAdd sparklines to show a quick trend of each age group category.\r\n5\r\nThe line graph may not be effectively used for the categorical data. It may unintended emphasize the change between the age groups instead of the comparison of the two years.\r\nReplace with categorical charts using an arrow chart(similar effect as a bar chart highlighting the differences) to emphasize the change in 2009 and 2019.\r\n6\r\nThe median age reference line is misleading as the X-axis point is used as the actual age mark in the graph\r\nTo remove median age and reference line from the chart.\r\n1.2 Aesthetic\r\nS/N\r\nCritiques\r\nSuggestions\r\n7\r\nThe graph shows the redundant year 2009 and 2019 three times. These unnecessary non-data-inks add distraction to the graph.\r\nReduce the number of year labels appropriately.\r\n8\r\nNo contrasting colours for comparison. The colour gray and blue are similar and dull and could be hard for viewers with colour blindness.\r\nUse contrasting colour-blind friendly colours such as red and blue colours to highlight differences appropriately.\r\n9\r\nNon-data-ink such as the dark colour table and bolding of the X-axis divert focus away from the line chart.\r\nRemove dark colour table and un-bold axis label.\r\n10\r\nToo much different information in a single chart diverts the key points.\r\nRemove unnecessary chart objects\r\n2.0 Sketch of Proposed Design\r\n\r\n\r\n\r\nUse of simple phrases in title and text to provide relevant and concise information while allowing visualisation to be the main focus and speaks for itself. These wordings allow readers to quickly scan and derive insights.\r\nReduce non-data-ink by using acronym LFPR and sign % and avoid having too much text to distract or clutter the visual. The Colour of the axis and gridlines will be lightened to further reduce the non-data-ink.\r\nUse intervals of five for Age groups instead of the irregular interval to improve the clarity and avoid skewing the visual to larger groups.\r\nUsing Arrow chart allows providing clear percentage growth and the actual LPFR clearly in a creative way. Each arrow represents an age group for their LFPR and changes in 2009 and 2019. This is much easier to see the relative change compared to using bar charts where it may be hard to see when there are too many bars taking up much of the visual space. Or line charts where is used in the original visual may unintentionally emphasize the difference of the age groups instead of the two years.\r\nThe sparklines allow quick trending to see what is between the two years without providing too much information diverting the key focus as snapshot comparison can be misleading.\r\nChoice of chart colours will be blue and red which is colour-blind friendly yet simple yet and intuitive to highlight positive and negative\r\n3.0 Data Visualization Step-by-step guide\r\n3.1 Data preparation\r\n3.1.1 Pre-import data prep\r\nCopy the data from Excel sheet “T5_T” in mrsd_2019LabourForce_T5.xlsx into the new sheet Data. Remove the empty columns and format the records as shown.\r\n\r\n\r\n\r\n3.1.1 Import data into Tableau\r\nImport sheet “Data” from Excel into Tableau.\r\nSet field names are in first row.\r\nSelect column 2009 to 2019 and right click set pivot.\r\n\r\n\r\n\r\n3.1.2 Rename pivoted columns\r\nRename column Pivot Field Names to Year\r\nRename column Pivot Field Values to LFPR %\r\nFormat Year as date\r\n\r\n\r\n\r\n3.2 Create Arrow Chart\r\n3.2.1 Drag and drop the dimensions and measure\r\nDrag Age group to Columns\r\nDrag Year to Filters, select only 2009 and 2019.\r\nDrag LFPR % to Rows\r\n\r\n\r\n\r\nSet Marks as line chart\r\nDrag Year to Path\r\n\r\n\r\n\r\n3.2.2 Create Calculated Fields\r\nAnalysis -> Create Calculated Fields -> Direction. This is to get the difference of LFPR % of 2019 – 2009 to set the color and shape of the arrow chart. Click on Default Table Calculation to set the definition compute as Year and At the level year of year\r\n\r\n\r\n\r\nCreate new Calculated Field, Shape\r\n3.2.3 Create Shape and dual axis\r\nDrag LFPR % to Rows again\r\nSet Marks as Shape\r\nDrag Year to detail\r\nApply Dual Axis\r\n\r\n\r\n\r\n3.2.4 Create Arrow Head\r\nCreate new Calculated Field call shape and set positive or negative based on the [Direction] created earlier.\r\n\r\n\r\n\r\nDrag field Shape into both Color and change the color to red and blue\r\nDrag field Shape again to shape (mark) and change shape palette to filled - triangle up and down for + and - respectively\r\n\r\n\r\n\r\n\r\n\r\n\r\n3.2.5 Remove the extra triangle\r\ni)To remove the extra triangle, create new calculated field call Size of Shape\r\n\r\n\r\n\r\nii)Drag this new field to Size and this will change the shape sizes are not [Year] = 2019 and set size as 0 which making the triangle disappear.\r\n\r\n\r\n\r\n3.2.6 Complete the Arrow\r\nTo change synchronize the line color, select line Mark and drag Shape to Color. Click on Color and set markers to all. This will put the dot to better represent the starting point 2009.\r\nSynchronize the Right Y axis.\r\nClick on Size to increase the arrow line.\r\n\r\n\r\n\r\n3.2.7 Add in the % label\r\nSelect Shape Mark and drag Direction to Label\r\nUnder label appearance edit label <AGG(Direction)> % to add %.\r\nUnder font click match Mark color\r\n\r\n\r\n\r\nAlignment set to Center and Top\r\nHide repeated values in the Chart by setting the Mark Label “Never Show”.\r\nRemove the Right Y Axis\r\n3.2.7 Title and formatting\r\nHide all cards on the left to remove the filter/legends\r\nInsert caption for source and X Axis Source: Table 5: RESIDENT LABOUR FORCE PARTICIPATION RATE BY AGE AND SEX, 2009 - 2019 (JUNE)\r\nIn format, add grid lines and remove row divider.\r\n\r\n\r\n\r\n3.3 Create Sparklines\r\n3.3.1 Create line chart as base\r\nDrag Year to column, and Age group and LFPR % to Rows\r\nEdit axis to change the Range to Independent axis ranges for each row. So the sparklines will be more obvious.\r\n\r\n\r\n\r\nSort the Age group by Descending order and hide the Y axis.\r\nFrom Color set markers to All to show the dots.\r\nRemove the row grid lines and column dividers using format.\r\nChange title to Year-on-Year LFPR to and align center.\r\nRemove x-axis header\r\nDrag Year into label and set mark to label as min/max Remove all point except for bottom age group as shown.\r\n\r\n\r\n\r\n3.4 Combining into Dashboard\r\n3.4.1 Create new dashboard\r\nDrag Arrow graph to the canvas\r\nDrag Sparklines to the right of arrow graph\r\nDrag image object import arrow image[custom image] to bottom right of arrow graph as legend\r\nAnd drag text objects beside the arrow and key as 2009 and 2019\r\n\r\n\r\n\r\n3.4.2 Annotation, Title size and white space alignment\r\nAdd text objects annotation for both charts to highlight the info.\r\nOlder age groups show higher increase in %\r\nYounger age groups show more fluctuations in their LFPR\r\nDashboard title size change to size 15\r\nChart titles change to size 12\r\nAdd blank objects to align the charts.\r\n\r\n\r\n\r\nData Visualisation makeover completed\r\n4.0 Major observations\r\n\r\n\r\n\r\nLabour force participation rate has increased for all age groups except for aged 20-24 which fall by 2.5% comparing 2019 against 2009.\r\nOlder age groups (above aged 55) have a higher increase in LFPR compared to the other age groups.\r\n\r\n\r\n\r\nYear-on-Year for age groups above 30 show gradual changes. However, age groups for 15-19, 20-24 and 25-29, are observed to have more fluctuations in their LFPR from 2009 to 2019.\r\n\r\n\r\n\r\n\r\n(https://public.tableau.com/profile/zlli#!/vizhome/LabourForceParticipationRate2009vs2019/Dashboard1)\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-01-27-dataviz-makeover-1/picture/0.png",
    "last_modified": "2021-02-19T21:22:25+08:00",
    "input_file": "dataviz-makeover-1.utf8.md"
  },
  {
    "path": "posts/2021-01-04-my-first-post/",
    "title": "My First R Markdown Document",
    "description": "A new article created using the Distill format.",
    "author": [
      {
        "name": "Dr. Kam Tin Seong",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-01-05",
    "categories": [],
    "contents": "\r\n1.0 Overview\r\nCorrelation coefficient is a popular statistic that use to measure the type and strength of the relationship between two variables. The values of a correlation coefficient ranges between -1.0 and 1.0. A correlation coefficient of 1 shows a perfect linear relationship between the two variables, while a -1.0 shows a perfect inverse relationship between the two variables. A correlation coeficient of 0.0 shows no linear relationship between the two variables.\r\nWhen multivariate data are used, the correlation coeficeints of the pair comparisons are displayed in a table form known as correlation matrix or scatterplot matrix.\r\nThere are three broad reasons for computing a correlation matrix.\r\nTo reveal the relationship between highdimensional variables pairwisely.\r\nTo input into other analyses. For example, people commonly use correlation matrixes as inputs for exploratory factor analysis, confirmatory factor analysis, structural equation models, and linear regression when excluding missing values pairwise.\r\nAs a diagnostic when checking other analyses. For example, with linear regression a high amount of correlations suggests that the linear regression’s estimates will be unreliable.\r\nWhen the data is large, both in terms of the number of observations and the number of variables, Corrgram tend to be used to visually explore and analyse the structure and the patterns of relations among variables. It is designed based on two main schemes:\r\nRendering the value of a correlation to depict its sign and magnitude, and\r\nReordering the variables in a correlation matrix so that “similar” variables are positioned adjacently, facilitating perception.\r\nIn this hands-on exercise, you will learn how to plot data visualisation for visualising correlation matrix with R. It consists of three main sections. First, you will learn how to create correlation matrix using pairs() of R Graphics. Next, you will learn how to plot corrgram using corrplot package of R Lastly, you will learn how to create an interactive correlation matrix using plotly R. .\r\n2.0 Installing and Launching R Packages\r\nBefore you get started, you are required:\r\nto start a new R project, and\r\nto create a new R Markdown document.\r\nNext, you will use the code chunk below to install and launch corrplot, ggpubr, plotly and tidyverse in RStudio.\r\n\r\n\r\npackages = c('ggpubr', 'tidyverse')\r\n\r\nfor(p in packages){library\r\n  if(!require(p, character.only = T)){\r\n    install.packages(p)\r\n  }\r\n  library(p, character.only = T)\r\n}\r\n\r\n\r\n\r\n3.0 Importing and Preparing The Data Set\r\nIn this hands-on exercise, the Wine Quality Data Set of UCI Machine Learning Repository will be used. The data set consists of 13 variables and 6497 observations. For the purpose of this exercise, we have combined the red wine and white wine data into one data file. It is called wine_quality and is in csv file format.\r\n3.1 Importing Data\r\nFirst, let us import the data into R by using read_csv() of readr package.\r\n\r\n\r\nwine <- read_csv(\"data/wine_quality.csv\")\r\n\r\n\r\n\r\nNotice that beside quality and type, the rest of the variables are numerical and continuous data type.\r\n4.0 Univariate EDA with Histogram\r\nIn the figure below, multiple histograms are plottted to reveal the distribution of the selected variables in the wine quality data sets.\r\n\r\n\r\n\r\nThe code chunks used to create the data visualisation consists of two main parts. First, we will create the individual histograms using the code chunk below.\r\n\r\n\r\nfa <- ggplot(data=wine, aes(x= `fixed acidity`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nva <- ggplot(data=wine, aes(x= `volatile acidity`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nca <- ggplot(data=wine, aes(x= `citric acid`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nrs <- ggplot(data=wine, aes(x= `residual sugar`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nch <- ggplot(data=wine, aes(x= `chlorides`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nfSO2 <- ggplot(data=wine, aes(x= `free sulfur dioxide`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\ntSO2 <- ggplot(data=wine, aes(x= `total sulfur dioxide`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\ndensity <- ggplot(data=wine, aes(x= density)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\npH <- ggplot(data=wine, aes(x= pH)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nsulphates <- ggplot(data=wine, aes(x= sulphates)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nalcohol <- ggplot(data=wine, aes(x= alcohol)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\n\r\n\r\n\r\nNext, the ggarrange function of ggpur package is used to group these histograms together.\r\n\r\n\r\nggarrange(fa, va, ca, rs, ch, fSO2, tSO2, density, pH, sulphates, alcohol, \r\n          ncol = 4, nrow = 3)\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-01-05T20:29:29+08:00",
    "input_file": {}
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to IDEA",
    "description": "Welcome to our new blog, IDEA. We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "Li Zhenglong",
        "url": {}
      }
    ],
    "date": "2021-01-04",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-01-04T21:05:07+08:00",
    "input_file": {}
  }
]
